---
type: EditorInteraction
namespace: Autodesk.Revit.UI
version: 2024
members: 3
tags: [revit-api, class]
---

# EditorInteraction

`Autodesk.Revit.UI.EditorInteraction` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | EditorInteraction | — | `` |
| Constructor | EditorInteraction | — | `public EditorInteraction ()` |
| Property | InteractionType | — | `public virtual EditorInteractionType InteractionType { get ; set ; }` |